Revit 2024 API
TableSectionData.IsAcceptableParamIdAndCategoryId Method (Int32, ElementId, ElementId)
 Identifies if the given parameter id and category id can be assigned to a cell in the given row in this table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsAcceptableParamIdAndCategoryId(
	int nRow,
	ElementId paramId,
	ElementId categoryId
)
Visual Basic
Public Function IsAcceptableParamIdAndCategoryId ( _
	nRow As Integer, _
	paramId As ElementId, _
	categoryId As ElementId _
) As Boolean
Visual C++
public:
bool IsAcceptableParamIdAndCategoryId(
	int nRow,
	ElementId^ paramId,
	ElementId^ categoryId
)
Parameters
nRow
Type: System.Int32
 row index
paramId
Type: Autodesk.Revit.DB.ElementId
categoryId
Type: Autodesk.Revit.DB.ElementId
Return Value
 True if the ParamId and CategoryId are all valid.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TableSectionData Class
IsAcceptableParamIdAndCategoryId Overload
Autodesk.Revit.DB Namespace